// Title of Detection:   Active Directory (AD) User Account Created Or Enabled 
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
 // Description of the Detection: 
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where EventID in (4720, 4722)
