SecurityEvent 
| where EventID == 4625 // 4625 - An account failed to log on
// Extending PasswordStatus with meaningful messages
| extend PasswordStatus1 = iff(Status == "0xC000005E", "No logon servers available to service the logon request.", "")
| extend PasswordStatus2 = iff(Status == "0xC0000064", "Misspelled or bad user account", "")
| extend PasswordStatus3 = iff(Status == "0xC000006A", "Misspelled or bad password", "")
| extend PasswordStatus4 = iff(Status == "0xC000006D", "Bad username or authentication information", "")
| extend PasswordStatus5 = iff(Status == "0xC000006E", "Account restriction (time-of-day restriction)", "")
| extend PasswordStatus6 = iff(Status == "0xC000006F", "User logon outside authorized hours", "")
| extend PasswordStatus7 = iff(Status == "0xC0000070", "User logon from unauthorized workstation", "")
| extend PasswordStatus8 = iff(Status == "0xC0000071", "User logon with expired password", "")
| extend PasswordStatus9 = iff(Status == "0xC0000072", "Account disabled by administrator", "")
| extend PasswordStatus10 = iff(Status == "0xC00000DC", "Sam Server state issue", "")
| extend PasswordStatus11 = iff(Status == "0xC0000133", "Clocks out of sync between DC and other computer", "")
| extend PasswordStatus12 = iff(Status == "0xC000015B", "Requested logon type not granted", "")
| extend PasswordStatus13 = iff(Status == "0xC000018C", "Trust relationship failed", "")
| extend PasswordStatus14 = iff(Status == "0xC0000192", "Netlogon service not started", "")
| extend PasswordStatus15 = iff(Status == "0xC0000193", "Expired account", "")
| extend PasswordStatus16 = iff(Status == "0xC0000224", "User must change password at next logon", "")
| extend PasswordStatus17 = iff(Status == "0xC0000225", "Windows bug, not a risk", "")
| extend PasswordStatus18 = iff(Status == "0xC0000234", "Account locked", "")
| extend PasswordStatus19 = iff(Status == "0xC00002EE", "Error during logon", "")
| extend PasswordStatus20 = iff(Status == "0xC0000413", "Authentication firewall prevented logon", "")
| extend PasswordStatus21 = iff(Status == "0x0", "Logon successful", "")
| extend PasswordStatusText = strcat(PasswordStatus1, PasswordStatus2, PasswordStatus3, PasswordStatus4, PasswordStatus5, PasswordStatus6, PasswordStatus7, PasswordStatus8, PasswordStatus9, PasswordStatus10, PasswordStatus11, PasswordStatus12, PasswordStatus13, PasswordStatus14, PasswordStatus15, PasswordStatus16, PasswordStatus17, PasswordStatus18, PasswordStatus19, PasswordStatus20, PasswordStatus21)

// SubStatus extension
| extend PasswordSubStatus1 = iff(SubStatus == "0xC000005E", "No logon servers available.", "")
| extend PasswordSubStatus2 = iff(SubStatus == "0xC0000064", "Bad user account", "")
| extend PasswordSubStatus3 = iff(SubStatus == "0xC000006A", "Bad password", "")
| extend PasswordSubStatus4 = iff(SubStatus == "0xC000006D", "Bad username/authentication", "")
| extend PasswordSubStatus5 = iff(SubStatus == "0xC000006E", "Account restriction", "")
| extend PasswordSubStatus6 = iff(SubStatus == "0xC000006F", "Logon outside authorized hours", "")
| extend PasswordSubStatus7 = iff(SubStatus == "0xC0000070", "Unauthorized workstation", "")
| extend PasswordSubStatus8 = iff(SubStatus == "0xC0000071", "Expired password", "")
| extend PasswordSubStatus9 = iff(SubStatus == "0xC0000072", "Account disabled", "")
| extend PasswordSubStatus10 = iff(SubStatus == "0xC00000DC", "Sam Server error", "")
| extend PasswordSubStatus11 = iff(SubStatus == "0xC0000133", "Clocks out of sync", "")
| extend PasswordSubStatus12 = iff(SubStatus == "0xC000015B", "Logon type not granted", "")
| extend PasswordSubStatus13 = iff(SubStatus == "0xC000018C", "Trust failure", "")
| extend PasswordSubStatus14 = iff(SubStatus == "0xC0000192", "Netlogon service failed", "")
| extend PasswordSubStatus15 = iff(SubStatus == "0xC0000193", "Expired account", "")
| extend PasswordSubStatus16 = iff(SubStatus == "0xC0000224", "Password change required", "")
| extend PasswordSubStatus17 = iff(SubStatus == "0xC0000225", "Windows bug", "")
| extend PasswordSubStatus18 = iff(SubStatus == "0xC0000234", "Account locked", "")
| extend PasswordSubStatus19 = iff(SubStatus == "0xC00002EE", "Logon error", "")
| extend PasswordSubStatus20 = iff(SubStatus == "0xC0000413", "Firewall prevented logon", "")
| extend PasswordSubStatus21 = iff(SubStatus == "0x0", "Logon successful", "")
| extend PasswordSubStatusText = strcat(PasswordSubStatus1, PasswordSubStatus2, PasswordSubStatus3, PasswordSubStatus4, PasswordSubStatus5, PasswordSubStatus6, PasswordSubStatus7, PasswordSubStatus8, PasswordSubStatus9, PasswordSubStatus10, PasswordSubStatus11, PasswordSubStatus12, PasswordSubStatus13, PasswordSubStatus14, PasswordSubStatus15, PasswordSubStatus16, PasswordSubStatus17, PasswordSubStatus18, PasswordSubStatus19, PasswordSubStatus20, PasswordSubStatus21)

// Logon Type information
| extend LogonTypeInfo1 = iff(LogonType == 0, "System account logon at startup", "")
| extend LogonTypeInfo2 = iff(LogonType == 2, "User logged on locally", "")
| extend LogonTypeInfo3 = iff(LogonType == 3, "Logon from network", "")
| extend LogonTypeInfo4 = iff(LogonType == 4, "Batch logon", "")
| extend LogonTypeInfo5 = iff(LogonType == 5, "Service started by Service Control Manager", "")
| extend LogonTypeInfo6 = iff(LogonType == 7, "Workstation unlocked", "")
| extend LogonTypeInfo7 = iff(LogonType == 8, "Logon from network with unhashed credentials", "")
| extend LogonTypeInfo8 = iff(LogonType == 9, "New credentials for outbound network connections", "")
| extend LogonTypeInfo9 = iff(LogonType == 10, "Remote logon via Terminal Services or RDP", "")
| extend LogonTypeInfo10 = iff(LogonType == 11, "Logon with cached credentials", "")
| extend LogonTypeInfo11 = iff(LogonType == 12, "Internal auditing logon", "")
| extend LogonTypeInfo12 = iff(LogonType == 13, "Workstation logon", "")
| extend LogonTypeInfo = strcat(LogonTypeInfo1, LogonTypeInfo2, LogonTypeInfo3, LogonTypeInfo4, LogonTypeInfo5, LogonTypeInfo6, LogonTypeInfo7, LogonTypeInfo8, LogonTypeInfo9, LogonTypeInfo10, LogonTypeInfo11, LogonTypeInfo12)

// Exclude certain logon types and error statuses
| where LogonTypeName != "3 - Network" // Background processes
| where Status != "0xC000010b" and LogonTypeName == "11 - Cached Interactive"
| where not(LogonTypeName == "5 - Service" and Status == "0xc0000001" and Account == "-\\-")
| where not(StatusText == "No logon servers available" or StatusText == "User required to change password" and SubStatus == "0x0")
| where not(StatusText == "Bad username or authentication" and (SubStatusText == "Bad password" or SubStatus == "0x0"))

// Final selection
| project TimeGenerated, Computer, Account, LogonType, Status, SubStatus, LogonTypeInfo, PasswordStatusText, PasswordSubStatusText
