// Title of Detection: Brute Force with Invalid Password
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection:   Sustained over 12 hours
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where TimeGenerated >= ago(12h)
| where EventID == '4771' // 4771 is Kerberos pre-authentication failed. failure to log in 
| where Status "0x18" //  pre-auth information was invalid which translates to incorrect password
| summarize count() by bin(TimeGenerated, 3h), TargetAccount, IpAddress // groups the fails every 3 hours
| sort by TargetAccount, TimeGenerated asc
| where count_ >= 20
| project-rename InvalidPasswordPerThreeHours = count_
| summarize ThreeHourCountOfSustainedBruteForce = count() by TargetAccount
| where ThreeHourCountOfSustainedBruteForce >= 3 
