// Title of Detection: Builtin\\Administrators Successful Logon
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
 // Description of the Detection: Builtin\\Administrators shoudn’t really be used to log in as its not best security practice.
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where EventID == 4624 and (TargetAccount == "Builtin\\Administrators" or Account == "Builtin\\Administrators")
