// Title of Detection:   Credential Dumping via  Windows Network Providers
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection: 
// References (if available): https://www.socinvestigation.com/credential-dumping-using-windows-network-providers-how-to-respond
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where EventID in (4656, 4657, 4658) and EventData matches regex @'HKLM\\SYSTEM\\CurrentControlSet\Control\\NetworkProvider\\Order\\ProviderOrder'
