// Title of Detection: Directory Services Restore Mode (DRSM) Admin Password Change Attempt
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection: Event ID 4794 - An attempt was made to set the Directory Services Restore Mode administrator password
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where EventID == 4794
