// Title of Detection:  domain controller logon from the subnets exterior ranges
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
 // Description of the Detection:  
// References (if available): https://blog.menasec.net/2019/02/threat-hunting-6-hiding-in-plain-sights.html 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where  EventID in (4624, 4625) and LogonType == 3 and Account matches regex (insert your Domain controller Account name or its Naming Format if there’s multiple) and not(IpAddress in ("::1","-","127.0.0.1", "fe80::")) and not(IpAddress matches regex (insert your Domain controller  IP Range/s))
