// Title of Detection:  Explicit Credentials use in Logon whether success or fail
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
 // Description of the Detection: This will spot EVENTID 4648 LOGON ATTEMPTED USING EXPLICIT CREDENTIALS. You may need to exclude certain high privilege subjects and account types. Please note the exclusion of "S-1-0-0" is for removing -\-
// References (if available):  https://community.spiceworks.com/topic/1439440-windows-audit-failures-event-id-4625
https://learn.microsoft.com/en-us/windows/win32/secauthz/well-known-sids 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where EventID == 4648 and TargetAccount != SubjectAccount and AccountType <> "Machine" and SubjectUserSid <> "S-1-0-0"
