// Title of Detection: Flow of Event Telemetry Blocking Detection Response
// Authorship & Contact: https://allthingscomputers.medium.com, https://twitter.com/allthingshandle, https://allthingscomputersblog.wordpress.com/
// Description of the Detection: Detects potential blocking of event telemetry
// References: https://www.socinvestigation.com/the-flow-of-event-telemetry-blocking-detection-response

SecurityEvent
| where EventID == 4688
| where 
    // Detect use of logman.exe with suspicious commands
    (NewProcessName endswith @"\logman.exe" and 
        (CommandLine contains "query" or CommandLine contains "update" or CommandLine contains "EventLog"))
    or 
    // Detect use of PowerShell.exe with suspicious commands
    (NewProcessName endswith @"\powershell.exe" and 
        (CommandLine contains "Remove-EtwTraceProvider" or 
         CommandLine contains "AutologgerName" or 
         CommandLine contains "EventLog" or 
         CommandLine contains "Set-EtwTraceProvider" or 
         CommandLine contains "Property"))
    or 
    // Detect use of wpr.exe
    (NewProcessName endswith @"\wpr.exe")
