// Title of Detection:  Log In Events Deleted
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection:    Adversaries may delete interactive log in events to hide the fact they logged in but may forget to delete their interactive log out events in the logs that will be sent to the SIEM. This will alert when there are more log out than log in events would indicate tampering.
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
let timePeriod= 1d;
let logon = (SecurityEvent
| where TimeGenerated > ago(timePeriod)
| where EventID == 4624 and LogonType == 2 and isnotempty(Account)
| summarize count() by EventID, Account
| extend Event4624LogOnCount=count
| project-away count_;)
let logoff = (SecurityEvent
| where TimeGenerated > ago(timePeriod)
| where EventID == 4634 and LogonType == 2 and isnotempty(Account)
| summarize count() by EventID, Account)
| extend Event4634LogOffCount=count
| project-away count_;
logon
| join kind-inner (logoff) on Account
| project-away Account1, EventID, EventID1
| project-reorder Account, Event4624LogOnCount, Event4634LogOffCount
| where Event4624LogOnCount == 0 and Event4634LogOffCount> 3; 
