// Title of Detection: New Service Installed Soon After Remote Logon
// Authorship & Contact: https://allthingscomputers.medium.com, https://twitter.com/allthingshandle, https://allthingscomputersblog.wordpress.com/
// Description: Detects installation of new services shortly after remote logon connections.
// References: https://www.socinvestigation.com/hunting-for-suspect-windows-services-mind-map/

let ConnectionAllowedEvent = SecurityEvent
| where EventID == 5156
| where Application endswith @"\services.exe"
| where SourceAddress != DestAddress 
    and toint(SourcePort) >= 49152 
    and toint(DestPort) >= 49152
    and isnotempty(SourceAddress) 
    and isnotempty(DestAddress)
| extend ConnectionAllowedTime = TimeGenerated;

let ServiceInstalledEvent = SecurityEvent
| where EventID in (7045, 4697)  // 7045: Service installed, 4697: New service account created
| extend ServiceInstalledTime = TimeGenerated;

ServiceInstalledEvent
| join kind=inner (
    ConnectionAllowedEvent
    | extend ServiceInstalledTime = ConnectionAllowedTime // For join compatibility
) on Computer
| where datetime_diff("minute", ServiceInstalledTime, ConnectionAllowedTime) <= 2
| project Computer, ServiceInstalledTime, ConnectionAllowedTime, SourceAddress, DestAddress, SourcePort, DestPort, EventID;
