// Title of Detection:   possible lateral movement via RDP
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
 // Description of the Detection:   Indicator for possible lateral movement detection.  RDP outbound connection from end user machine is known to a RDP outbound connection from end user machine.
// References (if available):   https://www.socinvestigation.com/threat-hunting-using-windows-eventid-4648-logon-logoff/ 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where EventID == 4648 and EventData contains @'/TERMSRV/'
