// Title of Detection: Potential Passwords saved in Plaintext
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection:   
// References (if available): https://www.passcamp.com/blog/dangers-of-storing-and-sharing-passwords-in-plaintext/ 
// The Logic of the Detection or Query Begins Below This Line
let PasswordSynonyms = dynamic(["password", "p@ssword", "p@ssword", "PW", "pwd" "passphrase", "private key", "key"]); // this isn’t a full list of synonyms so please add more
let FPfiles = dynamic(["sample.mdb", "README.md"]);
let packageFPExtensions = dynamic (["js", "ts", "json", "html", "yml", "css", "map"]); // 
removed to reduce noise as its related to developer auto-name files oftenthiswill reduce name from packages downloaded by tech teams
let commonExtensions = dynamic(["doc", "pdf", "xlsx", "txt", "csv", "png", "jpg", "PNG", "zip", "JPG", "msg", "one", "aspx", "rtf", "pptx", "DOC", "xml", "PDF", "exe", "jpeg", "7z", "doc", "GIF", "TXT","docx"]);
let RecycledRenamed = OfficeActivity
| where OfficeObjectld has any (PasswordSynonyms)
| where Operation has_any("FileDeletedFirstStageRecycleBin", "FolderDeletedFirstStageRecycleBin", "FileDeletedSecondStageRecycleBin", "FolderDeletedSecondStageRecycleBin", "FileDeleted", "FileVersionsAllDeleted", "FileRecycled", "Folder Recycled", "FileRenamed", "FolderRenamed")
| summarize count() by OfficeObjectld, SourceFileName, SourceFileExtension, SourceRelativeUrl;
let CreatedRenamed = OfficeActivity 
| where OfficeObjectld has_any (PasswordSynonyms)
| where SourceFileName !in (FPfiles)
| where SourceFileExtension !in (packageFPExtensions) and SourceFileExtension <> ""
| where SourceFileExtension in (commonExtensions)
| where Operation has_any ("FileSyncUploadedFull", "FolderCreated", "File Uploaded")
| summarize count() by OfficeObjectld, SourceFileName, SourceFileExtension, Source RelativeUrl, Userld; 
CreatedRenamed
| join kind=leftanti == (RecycledRenamed) on OfficeObjectld // this is joined with Recycled Renamed Table to remove files that have since been recycled or Renamed to reduce FP
| sort by OfficeObjectld asc 
