// Title of Detection: Process Ran from Users AppData Folder
// Authorship & Contact: https://allthingscomputers.medium.com, https://twitter.com/allthingshandle, https://allthingscomputersblog.wordpress.com/
// Description of the Detection: Detects binaries executed from the AppData directory to identify suspicious activity.
// References: N/A

SecurityEvent
| where NewProcessName contains @"C:\Users\" and NewProcessName contains @"\AppData\Local\Temp\" and NewProcessName endswith ".exe"
| extend ExecutedOnServer = iff(Computer startswith "Server", "Yes", "No")
| extend ExecutedByAdminAccount = iff(Account contains_any("adm", "admin"), "Yes", "No")
| extend ExecutedByEventDataAdmin = iff(EventData_SubjectUserName contains_any("adm", "admin"), "Yes", "No")
| extend AdminExecuted = iif(ExecutedByAdminAccount == "Yes" or ExecutedByEventDataAdmin == "Yes", "Yes", "No")
| where ExecutedOnServer != "Yes" or AdminExecuted != "Yes"
| project TimeGenerated, Computer, Account, NewProcessName, ParentProcessName, ProcessName, AdminExecuted, ExecutedOnServer
