// Title of Detection:  psexec Remote Windows Service Creation and Recon
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection: 
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
let NetworkShareObjectWrite = SecurityEvent
| where EventID == 5145 and ShareName matches regex @"\\*\ADMINS|\\*\C$" and AccessList contains "%%4417"
WriteData extend NetworkShareObjectWrite Time = TimeGenerated;
let NetworkShareObjectSVCCTL = SecurityEvent
| where EventID == 5145 and ShareName == @'\\*\IPC$' and RelativeTargetName == 'svcctl'
| extend NetworkShareObjectSVCCTLTime == TimeGenerated;
NetworkShareObjectWrite
| join kind=inner (NetworkShareObjectSVCCTL) on Computer, Account, IpAddress, IpPort
| where datetime_diff('minute', NetworkShareObjectWriteTime, NetworkShareObjectSVCCTLTime) <= 1
| where NetworkShareObjectSVCCTLTime >= NetworkShareObjectWriteTime 
