// Title of Detection:  Remote Desktop Protocol (RDP) connections made outbound 
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection: this is the indicator for user machine with outbound RDP connections detected. This can be mapped to T1076 of mitre and the active traces of lateral movement.  
// References (if available): https://www.socinvestigation.com/threat-hunting-using-windows-eventid-4648-logon-logoff/ 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where EventID == 4648 and Process =~ 'mstsc.exe'
