// Title of Detection:  Remote Windows Service Creation and Recon 
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection:   windows builtin 
// References (if available):  https://blog.menasec.net/2019/03/threat-hunting-26-remote-windows.html 
// The Logic of the Detection or Query Begins Below This Line
let connection = SecurityEvent
| where EventID == 5156
| where Application contains @"\services.exe"
| where SourceAddress != DestAddress and SourcePort >= 49152 and DestPort >= 49152 and SourceAddress != '-' and DestAddress != '-' 
| extend connectionTime = TimeGenerated
| summarize arg_min(connection Time, *) by EventID, Application, SourceAddress, DestAddress, toint(SourcePort), toint(DestPort);
let serviceinstalled = SecurityEvent
| where (EventID == 7045 or EventID == 4697)
| extend serviceinstalledTime = TimeGenerated;
connection
| join kind-inner (serviceinstalled) on Computer  // to be inside 2 min and same ComputerName
| where serviceinstalledTime > connectionTime and where datetime_diff('minute', serviceinstalledTime, connectionTime) <= 2 
