// Title of Detection: Silver Ticket Attack Conditions
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection:  
// References (if available): https://www.socinvestigation.com/detecting-and-preventing-a-silver-ticket-attack/
// The Logic of the Detection or Query Begins Below This Line
let SuccessfulLoginEvents =
SecurityEvent
| where TimeGenerated > ago(1h)
| where EventID == 4769
| summarize by tolower(TargetUserName); 
SecurityEvent 
| where TimeGenerated between (ago(100d).. ago(1h))
| where EventID ==  4624 
| where isnotempty(TargetUserName)
| where TicketEncryptionType =~ "0x17"
| extend BasicName = extract(@"[^@]*", 0, TargetUserName)
| where BasicName !in~ (SuccessfulLoginEvents)
