// Title of Detection:    Silver Ticket Attack Conditions Noted
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
 // Description of the Detection:   
// References (if available): https://www.socinvestigation.com/detecting-and-preventing-a-silver-ticket-attack/ 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where EventID in (4624, 4634, 4672) and (isempty(Account) or Account == "-")
