// Title of Detection:   Successful Login with Password Older than Expiry Date 
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection:  
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
let PasswordLastSet = SecurityEvent
| where TimeGenerated >= ago(180d)
| where EventID in (4723, 4724) // password change events
| summarize arg_max(TimeGenerated, *) by TargetAccount
| project-rename TimeOfPWChange = TimeGenerated;
let LogonSuccessToday = SecurityEvent
| where TimeGenerated >= ago(24h)
| where EventID in (4624) //successful login event
| summarize arg_max(TimeGenerated, *) by TargetAccount
| project-rename TimeOfLogin = TimeGenerated; 
PasswordLastSet 
| join kind=inner LogonSuccessToday on TargetAccount
| where AccountType1 == "User"
| extend NoDaysSinceReset = (TimeOfLogin - TimeOfPWChange)
| where TimeOfLogin >= (TimeOfPWChange + 46d)
| project-reorder TargetAccount, TimeOfPWChange, EventID, TimeOfLogin, EventID1, NoDaysSince Reset 
