// Title of Detection:   suspect System Time modified
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection: detects the changing of legitimate windows and system time changes
// References (if available):  https://blog.menasec.net/2019/02/threat-hunting-19-suspect-system.html 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where EventID == 4616 and not(Account == "NT AUTHORITY\\LOCAL SERVICE" and ProcessName matches regex @"(?i)\\svchost.exe")
