// Title of Detection:    UEFI Persistence via WPBBIN detection
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection:  
// References (if available): https://www.socinvestigation.com/uefi-persistence-via-wpbbin-detection-response 
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where NewProcessName matches regex @'(?i)\\wpbbin\.exe$'
