// Title of Detection:  unlock of Password-Protected File 
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
 // Description of the Detection:  Password protection make it harder for traditional detection solutions to scan the attachment for malicious code. Windows Event ID  5379 to Detect Malicious Password-Protected File unlock
// References (if available): https://www.socinvestigation.com/windows-event-id-5379-to-detect-malicious-password-protected-file-unlock/
// The Logic of the Detection or Query Begins Below This Line
SecurityEvent
| where EventID == 5379 and EventData contains '.zip'
