// Title of Detection:  Modifications to AWSCloudTrails Monitoring
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
 // Description of the Detection: 
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
AWSCloudTrail
| where EventName in ("DeleteTrail", "StopLogging", "DeleteFlowLogs", "DeleteEventBus", "Update Trail")
