// Title of Detection:  Never seen before  AWSCloud Region
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection: 
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
AWSCloudTrail
| where AWSCloudRegion !in~ ("Expected", "AWSCloud", "Regions", "here")
