// Title of Detection:  Uncommon AWSCloudTrail Delete Event Logged
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
 // Description of the Detection: 
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
AWSCloudTrail
| where Event Name in ("DeleteBucketEncryption", "DeleteRepository", "Backup Deleted", "DeleteRecoveryPoint", "DeleteBackupVault", "DeleteDBCluster")
