// Title of Detection:  file name without words
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
// Description of the Detection:  Can also do no alphabet characters but vowels work. Can expand this to sysmon modules process files, schedule tasks, reg keys as malware does this. even command lines but should be in file created 11 sysmon event. malware creates random file names without words quite often. expect high FP
// References (if available): 
// The Logic of the Detection or Query Begins Below This Line
OfficeActivity 
| where isnotempty(SourceFileName)
| where isnotempty(SourceFileExtension)
| extend pathremoval = split(OfficeObjectld, '/',-1)[-1]
| extend extensionremoval = extract(@'.*\.', 0, tostring(pathremoval))
| where not(extensionremoval matches regex @"(?i)[aeiou]")
| project-reorder OfficeObjectld, pathremoval , extensionremoval 
