// Title of Detection:   Popular Ransomware File Extensions Detected
// Authorship & Contact: https://allthingscomputers.medium.com  https://twitter.com/allthingshandle  https://allthingscomputersblog.wordpress.com/ 
 // Description of the Detection:  
// References (if available):   https://www.file-extensions.org/filetype/extension/name/ransomware-encrypted-files
// The Logic of the Detection or Query Begins Below This Line
OfficeActivity
| where SourceFileExtension matches regex ‘(?i)\.(micro|loli|zepto|cerber3|locky|axx|cerber|onion|crypt|mole|cryp1|osiris|ccc|crypz|locked|pubg|odin|cerber2|encrypt|globe|exx|sexy|encrypted|sage|good|deadbolt|ezz|r5a|fantom|1txt|enciphered|coded|enigma|cryptowall|ecc|wallet|MERRY|zzzzz|cryptolocker|decrypt2017|aesir|breaking_bad|damage|kraken|ha3|lol!|wcry|dharma|rrk|maya|kratos|legion|windows10|mp3|MRCR1|LeChiffre|crjoker|serp|keybtc@inbox_com|zcrypt|enc|pdcr|crinf|ytbl|surprise|venusf|potato|file0locked|dale|zzz|angelamerkel|lesli|xxx|wflx|PEGS1|R16m01d05|remk|darkness|serpent|rnsmwr|Dexter|xyz|locklock|encr|evillock|thor|bin|kernel_time|derp|1cbu1|cry|nuclear55|purge|coverton|rekt|zyklon|VforVendetta|dCrypt|zorro|raid10|btc|fucked|AngleWare|shit|EnCiPhErEd|crab|atlas|crypted|exotic|realfs0ciety@sigaint.org.fs0ciety|unavailable|dll|vbransom|padcrypt|cryeye|enc|hush|paym|xxx|vvv|ttt|crptrgr|reco|RMCM1|73i87A|ruby|_AiraCropEncrypted|stn|abc|aaa|spora|braincrypt|encrypted|crypte|fun|alcatraz|rekt|RARE1|pzdc|szf|herbst|CCCRRRPPP|bitstak|pays|antihacker2017|magic|covid-19|hnumkhotep|rdm|helpmeencedfiles|odcodc|SecureCrypted|comrade|rip|powerfulldecrypt|BarRax|wncry|p5tkjw|PoAr2w|perl|kyra|covid19|info|bript|noproblemwedecfiles​|kkk|krab|a5zfn|vindows|payrms|lovewindows|madebyadam|czvxce|conficker|paymrss|kernel_complete|paymst|lcked|rokku|edgel|ifuckedyou|adk|kimcilware|oops|payms|kernel_pid|paymts|dxxd|rmd|razy|Whereisyourfiles|grt|theworldisyours|encrypted|d4nk|gefickt|kostya|vxlock|fun|pec|lock93)$’
